PengDrakes/NRF52833bcitest/examples/ble_peripheral/ble_app_uart/pca10100/s140/arm5_no_packs/ads1292.c
#include "ads1292.h"
#include "attention.h"

#include <stdint.h>
#include <stdbool.h>
#include <stddef.h>
#include <string.h>
#include <stdio.h>

#include "nrf_drv_spi.h"
#include "nrf_gpio.h"
#include "nrfx_gpiote.h"
#include "nrf_delay.h"

#include "FreeRTOS.h"
#include "task.h"

#include "arm_math.h"


/* ============================================================
 * User configuration
 * ============================================================ */

/*
 * 0 = Real EEG input
 *     CH2 = IN2P - IN2N
 *
 * 1 = Internal 1 Hz test square wave
 */
#define ADS1292_INTERNAL_TEST        0


/*
 * Periodic UART print interval.
 *
 * IMPORTANT:
 *
 * Previous value:
 *     25 samples
 *
 * At 250 SPS:
 *     25 / 250 = 0.1 s
 *
 * This corresponds to exactly:
 *     5 cycles at 50 Hz
 *     6 cycles at 60 Hz
 *
 * Therefore 25 may repeatedly sample almost the same phase of
 * mains interference and hide a periodic waveform.
 *
 * New value:
 *     23 samples
 *
 * 23 / 250 = 0.092 s
 *
 * This is not an integer number of 50/60 Hz cycles.
 */
#define ADS1292_PRINT_INTERVAL       23U


/*
 * Consecutive raw-sample diagnostic.
 *
 * Enable:
 *     1 = print one block of consecutive samples
 *     0 = disable
 *
 * Current configuration:
 *     start at sample 1200
 *     print 40 consecutive samples
 *
 * At 250 SPS:
 *     40 / 250 = 160 ms
 *
 * Enough to observe approximately:
 *     8 cycles at 50 Hz
 *     9.6 cycles at 60 Hz
 */
#define ADS1292_RAWSEQ_ENABLE        1U
#define ADS1292_RAWSEQ_START         1200U
#define ADS1292_RAWSEQ_COUNT         40U


/* DRDY timeout in milliseconds */
#define ADS1292_DRDY_TIMEOUT_MS      3000U


/* ============================================================
 * Timing
 *
 * The schematic uses the ADS1292R internal clock.
 * Nominal fCLK is approximately 512 kHz.
 *
 * 4 * tCLK is approximately 7.8125 us.
 * ============================================================ */

#define ADS1292_CMD_DELAY_US         10U
#define ADS1292_CS_END_DELAY_US      10U
#define ADS1292_CS_HIGH_DELAY_US     5U


/* ============================================================
 * SPI instance
 * ============================================================ */

static const nrf_drv_spi_t spi =
    NRF_DRV_SPI_INSTANCE(ADS1292_SPI_INSTANCE);


/* ============================================================
 * Internal driver state
 * ============================================================ */

static bool m_spi_initialized = false;
static bool m_ads1292_ready = false;
static bool m_in_rdatac = false;

/* Kept only for compatibility with the previous interface. */
static volatile bool spi_xfer_done = false;

/*
 * Current ADS1292R task handle.
 * The DRDY ISR notifies this task.
 */
static TaskHandle_t m_ads1292_task_handle = NULL;

/* Number of missed/accumulated DRDY notifications. */
static volatile uint32_t m_ads1292_overrun_count = 0U;


/* ============================================================
 * Existing project data
 *
 * Names are retained to avoid breaking other project modules.
 * ============================================================ */

uint8_t ads1292_data[9] = {0};

int32_t save_data[CYC_ARRAY_LEN] = {0};
uint32_t write_pos = 0U;
uint32_t read_pos = 0U;

int32_t save_data_0[CYC_ARRAY_LEN] = {0};
uint32_t write_pos_0 = 0U;
uint32_t read_pos_0 = 0U;

int32_t save_data_1[CYC_ARRAY_LEN] = {0};
uint32_t write_pos_1 = 0U;
uint32_t read_pos_1 = 0U;

volatile uint8_t init_data_collected = 0U;

static uint32_t sample_count = 0U;
static uint16_t init_index = 0U;

int32_t chn_adc_value[2] = {0};

float ch_v[2] = {
    0.0f,
    0.0f
};

float vol_v = 0.0f;
int32_t vol_value = 0;
int32_t vol_uv = 0;

float32_t data1[INIT_SAMPLE_COUNT] = {0};
float32_t data2[INIT_SAMPLE_COUNT] = {0};


/* ============================================================
 * Calibration variables
 * ============================================================ */

static float32_t max_init_val = 0.0f;
static uint32_t maxIndex = 0U;

static float32_t min_init_val = 0.0f;
static uint32_t minIndex = 0U;


/* ============================================================
 * GPIO diagnostics
 * ============================================================ */

static void ads1292_print_pinmap(void)
{
    printf(
        "ADS PINMAP: "
        "DRDY=%lu "
        "MISO=%lu "
        "SCK=%lu "
        "MOSI=%lu "
        "CS=%lu "
        "START=%lu "
        "RESET=%lu\r\n",

        (unsigned long)ADS1292_DRDY_PIN,
        (unsigned long)ADS1292_MISO_PIN,
        (unsigned long)ADS1292_SCK_PIN,
        (unsigned long)ADS1292_MOSI_PIN,
        (unsigned long)ADS1292_CS_PIN,
        (unsigned long)ADS1292_START_PIN,
        (unsigned long)ADS1292_RESET_PIN
    );
}


static void ads1292_print_gpio_diag(
    const char *tag
)
{
    uint32_t p0_out;
    uint32_t p0_dir;

    uint32_t p0_25_out;
    uint32_t p0_25_dir;
    uint32_t p0_25_cnf;

    if (tag == NULL)
    {
        tag = "ADS GPIO";
    }

    p0_out = NRF_P0->OUT;
    p0_dir = NRF_P0->DIR;

    p0_25_out =
        (p0_out >> 25U) &
        1UL;

    p0_25_dir =
        (p0_dir >> 25U) &
        1UL;

    p0_25_cnf =
        NRF_P0->PIN_CNF[25];

    printf(
        "%s: "
        "DRDY_IN=%lu "
        "START_OUT=%lu "
        "RESET_OUT=%lu\r\n",

        tag,

        (unsigned long)
        nrf_gpio_pin_read(
            ADS1292_DRDY_PIN
        ),

        (unsigned long)
        nrf_gpio_pin_out_read(
            ADS1292_START_PIN
        ),

        (unsigned long)
        nrf_gpio_pin_out_read(
            ADS1292_RESET_PIN
        )
    );

    printf(
        "%s: "
        "P0.25_RAW OUT=%lu "
        "DIR=%lu "
        "CNF=0x%08lX "
        "P0.OUT=0x%08lX "
        "P0.DIR=0x%08lX\r\n",

        tag,

        (unsigned long)p0_25_out,
        (unsigned long)p0_25_dir,
        (unsigned long)p0_25_cnf,
        (unsigned long)p0_out,
        (unsigned long)p0_dir
    );
}


/* ============================================================
 * SPI event handler
 *
 * Blocking SPI is currently used.
 * This function is retained for backward compatibility.
 * ============================================================ */

