PengDrakes/NRF52833bcitest/examples/ble_peripheral/ble_app_uart/pca10100/s140/arm5_no_packs/ads1292.c
void spi_event_handler(
    nrf_drv_spi_evt_t const *p_event,
    void *p_context
)
{
    (void)p_event;
    (void)p_context;

    spi_xfer_done = true;
}


/* ============================================================
 * CS control
 * ============================================================ */

static void ads1292_cs_low(void)
{
    nrf_gpio_pin_clear(
        ADS1292_CS_PIN
    );
}


static void ads1292_cs_high(void)
{
    /*
     * Keep enough time after the final SCLK edge.
     */
    nrf_delay_us(
        ADS1292_CS_END_DELAY_US
    );

    nrf_gpio_pin_set(
        ADS1292_CS_PIN
    );

    /*
     * Guarantee sufficient CS-high pulse width.
     */
    nrf_delay_us(
        ADS1292_CS_HIGH_DELAY_US
    );
}


/* ============================================================
 * Low-level SPI transfer
 * ============================================================ */

static ret_code_t ads1292_spi_transfer(
    const uint8_t *tx,
    uint8_t *rx,
    uint8_t length
)
{
    ret_code_t err;

    if ((tx == NULL) ||
        (length == 0U))
    {
        return NRF_ERROR_INVALID_PARAM;
    }

    ads1292_cs_low();

    err =
        nrf_drv_spi_transfer(
            &spi,
            tx,
            length,
            rx,
            (rx != NULL) ? length : 0U
        );

    ads1292_cs_high();

    return err;
}


/* ============================================================
 * Device initialization
 * ============================================================ */

void device_init(void)
{
    ret_code_t err;

    nrf_drv_spi_config_t spi_config =
        NRF_DRV_SPI_DEFAULT_CONFIG;

    /* --------------------------------------------------------
     * Configure GPIO pins
     * -------------------------------------------------------- */

    nrf_gpio_cfg_output(
        ADS1292_CS_PIN
    );

    nrf_gpio_cfg_output(
        ADS1292_RESET_PIN
    );

    nrf_gpio_cfg_output(
        ADS1292_START_PIN
    );

    nrf_gpio_cfg_input(
        ADS1292_DRDY_PIN,
        NRF_GPIO_PIN_NOPULL
    );

    /* --------------------------------------------------------
     * Safe initial state
     * -------------------------------------------------------- */

    nrf_gpio_pin_set(
        ADS1292_CS_PIN
    );

    nrf_gpio_pin_clear(
        ADS1292_START_PIN
    );

    nrf_gpio_pin_set(
        ADS1292_RESET_PIN
    );

    /* --------------------------------------------------------
     * Initialize SPI only once
     * -------------------------------------------------------- */

    if (!m_spi_initialized)
    {
        spi_config.sck_pin =
            ADS1292_SCK_PIN;

        spi_config.mosi_pin =
            ADS1292_MOSI_PIN;

        spi_config.miso_pin =
            ADS1292_MISO_PIN;

        /*
         * CS is manually controlled.
         */
        spi_config.ss_pin =
            NRF_DRV_SPI_PIN_NOT_USED;

        spi_config.frequency =
            NRF_DRV_SPI_FREQ_250K;

        /*
         * SPI Mode 1:
         *
         * CPOL = 0
         * CPHA = 1
         */
        spi_config.mode =
            NRF_DRV_SPI_MODE_1;

        spi_config.bit_order =
            NRF_DRV_SPI_BIT_ORDER_MSB_FIRST;

        /*
         * NULL handler:
         * blocking SPI transfer.
         */
        err =
            nrf_drv_spi_init(
                &spi,
                &spi_config,
                NULL,
                NULL
            );

        if (err != NRF_SUCCESS)
        {
            printf(
                "ADS1292 SPI init failed, "
                "err=%lu\r\n",
                (unsigned long)err
            );

            m_spi_initialized = false;

            return;
        }

        m_spi_initialized = true;
    }

    /* --------------------------------------------------------
     * Hardware reset
     * -------------------------------------------------------- */

    nrf_gpio_pin_clear(
        ADS1292_START_PIN
    );

    nrf_gpio_pin_set(
        ADS1292_RESET_PIN
    );

    nrf_delay_ms(100U);

    nrf_gpio_pin_clear(
        ADS1292_RESET_PIN
    );

    nrf_delay_ms(2U);

    nrf_gpio_pin_set(
        ADS1292_RESET_PIN
    );

    nrf_delay_ms(600U);

    /*
     * Treat post-reset state as RDATAC mode.
     */
    m_in_rdatac = true;
}


/* ============================================================
 * Send a single command
 * ============================================================ */

ret_code_t ads1292_send_cmd(
    uint8_t cmd
)
{
    uint8_t tx[1];

    tx[0] = cmd;

    return
        ads1292_spi_transfer(
            tx,
            NULL,
            1U
        );
}


/* ============================================================
 * Exit RDATAC mode
 * ============================================================ */

static ret_code_t ads1292_exit_rdatac(void)
{
    ret_code_t err;

    if (!m_in_rdatac)
    {
        return NRF_SUCCESS;
    }

    err =
        ads1292_send_cmd(
            ADS1292_CMD_SDATAC
        );

    if (err != NRF_SUCCESS)
    {
        return err;
    }

    nrf_delay_us(
        ADS1292_CMD_DELAY_US
    );

    m_in_rdatac = false;

    return NRF_SUCCESS;
}


/* ============================================================
 * Write one register
 * ============================================================ */

ret_code_t ads1292_write_reg(
    uint8_t reg,
    uint8_t value
)
{
    uint8_t tx[3];

    ret_code_t err;

    err =
        ads1292_exit_rdatac();

    if (err != NRF_SUCCESS)
    {
        return err;
    }

    tx[0] =
        ADS1292_CMD_WREG |
        (reg & 0x1FU);

    /*
     * One register:
     * N - 1 = 0.
     */
    tx[1] = 0x00U;

    tx[2] = value;

    return
        ads1292_spi_transfer(
            tx,
            NULL,
            3U
        );
}


/* ============================================================
 * Read one register
 * ============================================================ */

ret_code_t ads1292_read_reg(
    uint8_t reg,
    uint8_t *value
)
{
    uint8_t tx[3];
    uint8_t rx[3];

