PengDrakes/NRF52833bcitest/examples/ble_peripheral/ble_app_uart/pca10100/s140/arm5_no_packs/ads1292.c
    ret_code_t err;

    if (value == NULL)
    {
        return NRF_ERROR_NULL;
    }

    err =
        ads1292_exit_rdatac();

    if (err != NRF_SUCCESS)
    {
        return err;
    }

    memset(
        rx,
        0,
        sizeof(rx)
    );

    tx[0] =
        ADS1292_CMD_RREG |
        (reg & 0x1FU);

    /*
     * One register:
     * N - 1 = 0.
     */
    tx[1] = 0x00U;

    /*
     * Dummy byte.
     */
    tx[2] = 0x00U;

    err =
        ads1292_spi_transfer(
            tx,
            rx,
            3U
        );

    if (err == NRF_SUCCESS)
    {
        *value = rx[2];
    }

    return err;
}


/* ============================================================
 * Write register and verify by readback
 * ============================================================ */

static ret_code_t ads1292_write_verify(
    uint8_t reg,
    uint8_t value
)
{
    ret_code_t err;

    uint8_t readback = 0U;

    err =
        ads1292_write_reg(
            reg,
            value
        );

    if (err != NRF_SUCCESS)
    {
        return err;
    }

    err =
        ads1292_read_reg(
            reg,
            &readback
        );

    if (err != NRF_SUCCESS)
    {
        return err;
    }

    if (readback != value)
    {
        printf(
            "ADS register verify failed: "
            "reg=0x%02X "
            "write=0x%02X "
            "read=0x%02X\r\n",

            reg,
            value,
            readback
        );

        return NRF_ERROR_INTERNAL;
    }

    return NRF_SUCCESS;
}


/* ============================================================
 * ADS1292R initialization
 * ============================================================ */

void ads1292_init(void)
{
    ret_code_t err;

    uint8_t id = 0U;

    uint8_t rld_sens_readback = 0U;
    uint8_t resp2_readback = 0U;

    m_ads1292_ready = false;

    /* --------------------------------------------------------
     * Initialize lower layer if required
     * -------------------------------------------------------- */

    if (!m_spi_initialized)
    {
        device_init();
    }

    if (!m_spi_initialized)
    {
        printf(
            "ADS1292 SPI is not ready\r\n"
        );

        return;
    }

    /* --------------------------------------------------------
     * Exit RDATAC before register access
     * -------------------------------------------------------- */

    err =
        ads1292_exit_rdatac();

    if (err != NRF_SUCCESS)
    {
        printf(
            "ADS1292 SDATAC failed, "
            "err=%lu\r\n",

            (unsigned long)err
        );

        return;
    }

    /* --------------------------------------------------------
     * Read device ID
     * -------------------------------------------------------- */

    err =
        ads1292_read_reg(
            ADS1292_REG_ID,
            &id
        );

    if (err != NRF_SUCCESS)
    {
        printf(
            "ADS1292 ID read failed, "
            "err=%lu\r\n",

            (unsigned long)err
        );

        return;
    }

    printf(
        "ADS1292 ID value: 0x%02X\r\n",
        id
    );

    if (id != ADS1292_EXPECTED_ID)
    {
        printf(
            "ADS1292 ID error, "
            "expected 0x73\r\n"
        );

        return;
    }

    /* ========================================================
     * CONFIG1 = 0x01
     * 250 SPS
     * ======================================================== */

    err =
        ads1292_write_verify(
            ADS1292_REG_CONFIG1,
            0x01U
        );

    if (err != NRF_SUCCESS)
    {
        printf(
            "ADS1292 CONFIG1 failed, "
            "err=%lu\r\n",

            (unsigned long)err
        );

        return;
    }

    /* ========================================================
     * CONFIG2
     * ======================================================== */

#if ADS1292_INTERNAL_TEST

    /*
     * Internal reference enabled
     * Test signal enabled
     * 1 Hz square wave
     */
    err =
        ads1292_write_verify(
            ADS1292_REG_CONFIG2,
            0xA3U
        );

#else

    /*
     * Internal reference enabled
     * Test signal disabled
     */
    err =
        ads1292_write_verify(
            ADS1292_REG_CONFIG2,
            0xA0U
        );

#endif

    if (err != NRF_SUCCESS)
    {
        printf(
            "ADS1292 CONFIG2 failed, "
            "err=%lu\r\n",

            (unsigned long)err
        );

        return;
    }

    /*
     * Allow internal reference to settle.
     */
    vTaskDelay(
        pdMS_TO_TICKS(200U)
    );

    /* ========================================================
     * LOFF = 0x10
     * ======================================================== */

    err =
        ads1292_write_verify(
            ADS1292_REG_LOFF,
            0x10U
        );

    if (err != NRF_SUCCESS)
    {
        printf(
            "ADS1292 LOFF failed, "
            "err=%lu\r\n",

            (unsigned long)err
        );

        return;
    }

    /* ========================================================
     * CH1SET = 0x81
     *
     * CH1 powered down
     * input short
     * ======================================================== */

    err =
        ads1292_write_verify(
            ADS1292_REG_CH1SET,
            0x81U
        );

    if (err != NRF_SUCCESS)
    {
        printf(
            "ADS1292 CH1SET failed, "
            "err=%lu\r\n",

            (unsigned long)err
        );

        return;
    }

    /* ========================================================
     * CH2 configuration
     * ======================================================== */

#if ADS1292_INTERNAL_TEST

    /*
     * Gain = 6
     * MUX = internal test
     */
    err =
        ads1292_write_verify(
            ADS1292_REG_CH2SET,
            0x05U
        );

#else

    /*
     * CH2SET = 0x60
     *
     * Gain = 12
     * normal electrode input
     *
     * CH2 = IN2P - IN2N
     */
    err =
        ads1292_write_verify(
            ADS1292_REG_CH2SET,
            0x60U
        );

#endif

    if (err != NRF_SUCCESS)
    {
        printf(
            "ADS1292 CH2SET failed, "
            "err=%lu\r\n",

            (unsigned long)err
        );

        return;
    }

    /* ========================================================
     * RLD configuration
     * ======================================================== */

#if ADS1292_INTERNAL_TEST

