PengDrakes/NRF52833bcitest/examples/ble_peripheral/ble_app_uart/pca10100/s140/arm5_no_packs/ads1292.c
    /*
     * Internal test:
     * disable RLD.
     */
    err =
        ads1292_write_verify(
            ADS1292_REG_RLD_SENS,
            0x00U
        );

#else

#if ADS1292_ENABLE_RLD

    /*
     * RLD_SENS = 0x2C
     *
     * bit5 PDB_RLD = 1
     * bit3 RLD2N   = 1
     * bit2 RLD2P   = 1
     *
     * Enable RLD and sense CH2 IN2P + IN2N.
     */
    err =
        ads1292_write_verify(
            ADS1292_REG_RLD_SENS,
            ADS1292_RLD_SENS_CH2
        );

#else

    err =
        ads1292_write_verify(
            ADS1292_REG_RLD_SENS,
            0x00U
        );

#endif /* ADS1292_ENABLE_RLD */

#endif /* ADS1292_INTERNAL_TEST */

    if (err != NRF_SUCCESS)
    {
        printf(
            "ADS1292 RLD_SENS failed, "
            "err=%lu\r\n",

            (unsigned long)err
        );

        return;
    }

    /* ========================================================
     * LOFF_SENS = 0x00
     * ======================================================== */

    err =
        ads1292_write_verify(
            ADS1292_REG_LOFF_SENS,
            0x00U
        );

    if (err != NRF_SUCCESS)
    {
        printf(
            "ADS1292 LOFF_SENS failed, "
            "err=%lu\r\n",

            (unsigned long)err
        );

        return;
    }

    /* ========================================================
     * RESP1 = 0x02
     * Respiration disabled
     * ======================================================== */

    err =
        ads1292_write_verify(
            ADS1292_REG_RESP1,
            0x02U
        );

    if (err != NRF_SUCCESS)
    {
        printf(
            "ADS1292 RESP1 failed, "
            "err=%lu\r\n",

            (unsigned long)err
        );

        return;
    }

    /* ========================================================
     * RESP2 = 0x03
     *
     * Internal RLD reference
     * ======================================================== */

    err =
        ads1292_write_verify(
            ADS1292_REG_RESP2,
            ADS1292_RESP2_RLD_INT
        );

    if (err != NRF_SUCCESS)
    {
        printf(
            "ADS1292 RESP2 failed, "
            "err=%lu\r\n",

            (unsigned long)err
        );

        return;
    }

    /* ========================================================
     * GPIO = 0x0C
     * ======================================================== */

    err =
        ads1292_write_verify(
            ADS1292_REG_GPIO,
            0x0CU
        );

    if (err != NRF_SUCCESS)
    {
        printf(
            "ADS1292 GPIO failed, "
            "err=%lu\r\n",

            (unsigned long)err
        );

        return;
    }

    /* ========================================================
     * Final RLD readback
     * ======================================================== */

    err =
        ads1292_read_reg(
            ADS1292_REG_RLD_SENS,
            &rld_sens_readback
        );

    if (err != NRF_SUCCESS)
    {
        printf(
            "ADS1292 RLD_SENS final read failed, "
            "err=%lu\r\n",

            (unsigned long)err
        );

        return;
    }

    err =
        ads1292_read_reg(
            ADS1292_REG_RESP2,
            &resp2_readback
        );

    if (err != NRF_SUCCESS)
    {
        printf(
            "ADS1292 RESP2 final read failed, "
            "err=%lu\r\n",

            (unsigned long)err
        );

        return;
    }

    printf(
        "ADS RLD VERIFY: "
        "RLD_SENS=0x%02X "
        "RESP2=0x%02X\r\n",

        rld_sens_readback,
        resp2_readback
    );

    m_ads1292_ready = true;

    /* ========================================================
     * Final mode print
     * ======================================================== */

#if ADS1292_INTERNAL_TEST

    printf(
        "ADS1292 config OK: "
        "CH2 internal 1 Hz test, "
        "RLD OFF\r\n"
    );

#else

#if ADS1292_ENABLE_RLD

    printf(
        "ADS1292 config OK: "
        "CH2 EEG, "
        "250 SPS, "
        "Gain=12, "
        "RLD ON, "
        "sense=IN2P+IN2N\r\n"
    );

#else

    printf(
        "ADS1292 config OK: "
        "CH2 EEG, "
        "250 SPS, "
        "Gain=12, "
        "RLD OFF\r\n"
    );

#endif

#endif
}


/* ============================================================
 * Start continuous sampling
 * ============================================================ */

ret_code_t ads1292_start_sampling(void)
{
    ret_code_t err;

    if (!m_ads1292_ready)
    {
        return NRF_ERROR_INVALID_STATE;
    }

    nrf_gpio_pin_clear(
        ADS1292_START_PIN
    );

    nrf_delay_us(20U);

    /* Start conversion */
    err =
        ads1292_send_cmd(
            ADS1292_CMD_START
        );

    if (err != NRF_SUCCESS)
    {
        return err;
    }

    nrf_delay_us(20U);

    /* Enter RDATAC */
    err =
        ads1292_send_cmd(
            ADS1292_CMD_RDATAC
        );

    if (err != NRF_SUCCESS)
    {
        return err;
    }

    nrf_delay_us(
        ADS1292_CMD_DELAY_US
    );

    m_in_rdatac = true;

    ads1292_print_gpio_diag(
        "After START+RDATAC"
    );

    return NRF_SUCCESS;
}


/* ============================================================
 * Stop sampling
 * ============================================================ */

ret_code_t ads1292_stop_sampling(void)
{
    ret_code_t err;

    nrf_gpio_pin_clear(
        ADS1292_START_PIN
    );

    nrf_delay_us(20U);

    err =
        ads1292_exit_rdatac();

    return err;
}


/* ============================================================
 * Standby mode
 * ============================================================ */

void ads1292_standby(void)
{
    ret_code_t err;

    if (!m_spi_initialized)
    {
        return;
    }

    err =
        ads1292_stop_sampling();

    if (err != NRF_SUCCESS)
    {
        printf(
            "ADS1292 stop failed: %lu\r\n",
            (unsigned long)err
        );

        return;
    }

    err =
        ads1292_send_cmd(
            ADS1292_CMD_STANDBY
        );

    if (err != NRF_SUCCESS)
    {
        printf(
            "ADS1292 standby failed: %lu\r\n",
            (unsigned long)err
        );

        return;
    }

