PengDrakes/NRF52833bcitest/examples/ble_peripheral/ble_app_uart/pca10100/s140/arm5_no_packs/ads1292.c
    printf(
        "ADS1292 standby mode\r\n"
    );
}


/* ============================================================
 * Wakeup from standby
 * ============================================================ */

void ads1292_wakeup(void)
{
    ret_code_t err;

    if (!m_spi_initialized)
    {
        return;
    }

    err =
        ads1292_send_cmd(
            ADS1292_CMD_WAKEUP
        );

    if (err != NRF_SUCCESS)
    {
        printf(
            "ADS1292 wakeup failed: %lu\r\n",
            (unsigned long)err
        );

        return;
    }

    vTaskDelay(
        pdMS_TO_TICKS(20U)
    );

    err =
        ads1292_start_sampling();

    if (err != NRF_SUCCESS)
    {
        printf(
            "ADS1292 restart failed: %lu\r\n",
            (unsigned long)err
        );

        return;
    }

    printf(
        "ADS1292 wakeup mode\r\n"
    );
}


/* ============================================================
 * Sign extension:
 * 24-bit two's complement -> int32_t
 * ============================================================ */

int32_t ads1292_sign_extend_24(
    const uint8_t data[3]
)
{
    uint32_t value;

    if (data == NULL)
    {
        return 0;
    }

    value =
        ((uint32_t)data[0] << 16) |
        ((uint32_t)data[1] << 8) |
        ((uint32_t)data[2]);

    if ((value & 0x00800000UL) != 0UL)
    {
        value |= 0xFF000000UL;
    }

    return (int32_t)value;
}


/* ============================================================
 * Convert ADC code to microvolts
 *
 * Vinput =
 *
 *     code * VREF
 *     -----------
 *     Gain * 2^23
 * ============================================================ */

float ads1292_code_to_uv(
    int32_t code,
    uint8_t gain
)
{
    const float vref_uv =
        ADS1292_VREF_VOLTS *
        1000000.0f;

    if (gain == 0U)
    {
        return 0.0f;
    }

    return
        (
            (float)code *
            vref_uv
        )
        /
        (
            (float)gain *
            8388608.0f
        );
}


/* ============================================================
 * Read one complete 9-byte frame
 * ============================================================ */

ret_code_t ads1292_read_frame(
    ads1292_frame_t *frame
)
{
    uint8_t tx[9] = {0};
    uint8_t rx[9] = {0};

    ret_code_t err;

    if (frame == NULL)
    {
        return NRF_ERROR_NULL;
    }

    if (!m_in_rdatac)
    {
        return NRF_ERROR_INVALID_STATE;
    }

    err =
        ads1292_spi_transfer(
            tx,
            rx,
            9U
        );

    if (err != NRF_SUCCESS)
    {
        return err;
    }

    memcpy(
        ads1292_data,
        rx,
        9U
    );

    frame->status =
        ((uint32_t)rx[0] << 16) |
        ((uint32_t)rx[1] << 8) |
        ((uint32_t)rx[2]);

    frame->ch1 =
        ads1292_sign_extend_24(
            &rx[3]
        );

    frame->ch2 =
        ads1292_sign_extend_24(
            &rx[6]
        );

    return NRF_SUCCESS;
}


/* ============================================================
 * DRDY ISR
 * ============================================================ */

static void drdy_isr_handler(
    nrfx_gpiote_pin_t pin,
    nrf_gpiote_polarity_t action
)
{
    BaseType_t higher_priority_task_woken =
        pdFALSE;

    if ((pin == ADS1292_DRDY_PIN) &&
        (action == NRF_GPIOTE_POLARITY_HITOLO))
    {
        if (m_ads1292_task_handle != NULL)
        {
            vTaskNotifyGiveFromISR(
                m_ads1292_task_handle,
                &higher_priority_task_woken
            );

            portYIELD_FROM_ISR(
                higher_priority_task_woken
            );
        }
    }
}


/* ============================================================
 * DRDY interrupt initialization
 * ============================================================ */

static ret_code_t ads1292_drdy_irq_init(void)
{
    ret_code_t err;

    nrfx_gpiote_in_config_t in_config =
        NRFX_GPIOTE_CONFIG_IN_SENSE_HITOLO(true);

    in_config.pull =
        NRF_GPIO_PIN_NOPULL;

    err =
        nrfx_gpiote_init();

    if ((err != NRF_SUCCESS) &&
        (err != NRFX_ERROR_INVALID_STATE))
    {
        return err;
    }

    nrf_gpio_cfg_input(
        ADS1292_DRDY_PIN,
        NRF_GPIO_PIN_NOPULL
    );

    err =
        nrfx_gpiote_in_init(
            ADS1292_DRDY_PIN,
            &in_config,
            drdy_isr_handler
        );

    if (err != NRF_SUCCESS)
    {
        return err;
    }

    nrfx_gpiote_in_event_enable(
        ADS1292_DRDY_PIN,
        true
    );

    return NRF_SUCCESS;
}


/* ============================================================
 * Existing calibration function
 * ============================================================ */

void ADS1292_val_init(
    float32_t *data,
    float32_t *a,
    float32_t *b
)
{
    float32_t range;

    if ((data == NULL) ||
        (a == NULL) ||
        (b == NULL))
    {
        return;
    }

    arm_max_f32(
        data,
        INIT_SAMPLE_COUNT,
        &max_init_val,
        &maxIndex
    );

    arm_min_f32(
        data,
        INIT_SAMPLE_COUNT,
        &min_init_val,
        &minIndex
    );

    range =
        max_init_val -
        min_init_val;

    if (range == 0.0f)
    {
        *a = 0.0f;
        *b = 0.0f;

        return;
    }

    *a =
        180.0f /
        range;

    *b =
        220.0f -
        (*a) *
        max_init_val;
}


/* ============================================================
 * Existing respiration calibration function
 * ============================================================ */

void bre_val_init(
    float32_t *data,
    float32_t *a,
    float32_t *b
)
{
    float32_t range;

    if ((data == NULL) ||
        (a == NULL) ||
        (b == NULL))
    {
        return;
    }

    arm_max_f32(
        data,
        INIT_SAMPLE_COUNT,
        &max_init_val,
        &maxIndex
    );

    arm_min_f32(
        data,
        INIT_SAMPLE_COUNT,
        &min_init_val,
        &minIndex
    );

    range =
        max_init_val -
        min_init_val;

    if (range == 0.0f)
    {
        *a = 0.0f;
        *b = 0.0f;

        return;
    }

    *a =
        2.0f /
        range;

    *b =
        1.0f -
        (*a) *
        max_init_val;
}


/* ============================================================
 * FreeRTOS sampling task
 * ============================================================ */

