PengDrakes/NRF52833bcitest/examples/ble_peripheral/ble_app_uart/pca10100/s140/arm5_no_packs/ads1292.c
void spi_read(
    void *pvParameter
)
{
    ret_code_t err;

    ads1292_frame_t frame;

    uint32_t notify_count;

    float ch1_uv;
    float ch2_uv;

    (void)pvParameter;

    /* --------------------------------------------------------
     * Save task handle for DRDY ISR
     * -------------------------------------------------------- */

    m_ads1292_task_handle =
        xTaskGetCurrentTaskHandle();

    printf(
        "\r\nADS1292 task start\r\n"
    );

    ads1292_print_pinmap();

    /* ========================================================
     * 1. GPIO + SPI + reset
     * ======================================================== */

    device_init();

    ads1292_print_gpio_diag(
        "After device_init"
    );

    if (!m_spi_initialized)
    {
        printf(
            "ADS1292 device init failed\r\n"
        );

        m_ads1292_task_handle = NULL;

        vTaskDelete(NULL);

        return;
    }

    /* ========================================================
     * 2. Configure ADS1292R
     * ======================================================== */

    ads1292_init();

    ads1292_print_gpio_diag(
        "After ads1292_init"
    );

    if (!m_ads1292_ready)
    {
        printf(
            "ADS1292 config failed\r\n"
        );

        m_ads1292_task_handle = NULL;

        vTaskDelete(NULL);

        return;
    }

    /* ========================================================
     * 3. Initialize DRDY interrupt
     * ======================================================== */

    err =
        ads1292_drdy_irq_init();

    if (err != NRF_SUCCESS)
    {
        printf(
            "ADS1292 DRDY init failed, "
            "err=%lu\r\n",

            (unsigned long)err
        );

        m_ads1292_task_handle = NULL;

        vTaskDelete(NULL);

        return;
    }

    printf(
        "ADS1292 DRDY IRQ OK\r\n"
    );

    ads1292_print_gpio_diag(
        "After DRDY IRQ init"
    );

    /* ========================================================
     * 4. Start sampling
     * ======================================================== */

    err =
        ads1292_start_sampling();

    if (err != NRF_SUCCESS)
    {
        printf(
            "ADS1292 start failed, "
            "err=%lu\r\n",

            (unsigned long)err
        );

        m_ads1292_task_handle = NULL;

        vTaskDelete(NULL);

        return;
    }

    printf(
        "ADS1292 sampling started\r\n"
    );

    /* --------------------------------------------------------
     * Start Attention
     * -------------------------------------------------------- */

    if (!attention_init())
    {
        printf(
            "Attention estimator init failed\r\n"
        );
    }
    else
    {
        printf(
            "Attention estimator started\r\n"
        );
    }

    /* ========================================================
     * 5. Sampling loop
     * ======================================================== */

    for (;;)
    {
        /* ----------------------------------------------------
         * Wait for DRDY
         * ---------------------------------------------------- */

        notify_count =
            ulTaskNotifyTake(
                pdTRUE,
                pdMS_TO_TICKS(
                    ADS1292_DRDY_TIMEOUT_MS
                )
            );

        if (notify_count == 0U)
        {
            printf(
                "ADS1292 DRDY timeout\r\n"
            );

            ads1292_print_gpio_diag(
                "At DRDY timeout"
            );

            continue;
        }

        /* ----------------------------------------------------
         * Accumulated DRDY notifications
         * ---------------------------------------------------- */

        if (notify_count > 1U)
        {
            m_ads1292_overrun_count +=
                notify_count -
                1U;
        }

        /* ----------------------------------------------------
         * Read one frame
         * ---------------------------------------------------- */

        err =
            ads1292_read_frame(
                &frame
            );

        if (err != NRF_SUCCESS)
        {
            printf(
                "ADS1292 read failed, "
                "err=%lu\r\n",

                (unsigned long)err
            );

            continue;
        }

        /* ----------------------------------------------------
         * Validate STATUS high nibble
         * ---------------------------------------------------- */

        if ((ads1292_data[0] & 0xF0U) != 0xC0U)
        {
            continue;
        }

        sample_count++;

        /* ====================================================
         * CH1
         * ==================================================== */

        chn_adc_value[0] =
            frame.ch1;

        ch1_uv =
            ads1292_code_to_uv(
                frame.ch1,
                12U
            );

        ch_v[0] =
            ch1_uv /
            1000000.0f;

        /* ====================================================
         * CH2
         * ==================================================== */

        chn_adc_value[1] =
            frame.ch2;

#if ADS1292_INTERNAL_TEST

        ch2_uv =
            ads1292_code_to_uv(
                frame.ch2,
                6U
            );

#else

        ch2_uv =
            ads1292_code_to_uv(
                frame.ch2,
                ADS1292_CH2_GAIN
            );

#endif

        ch_v[1] =
            ch2_uv /
            1000000.0f;

        /* ====================================================
         * NEW DIAGNOSTIC:
         *
         * Print 40 consecutive samples once.
         *
         * This is intentionally placed after ch2_uv conversion.
         * ==================================================== */

#if ADS1292_RAWSEQ_ENABLE

        if (
            (sample_count >= ADS1292_RAWSEQ_START) &&
            (
                sample_count <
                (
                    ADS1292_RAWSEQ_START +
                    ADS1292_RAWSEQ_COUNT
                )
            )
        )
        {
            printf(
                "RAWSEQ "
                "N=%lu "
                "CH2=%lduV "
                "RAW=%ld "
                "OVR=%lu\r\n",

                (unsigned long)sample_count,
                (long)ch2_uv,
                (long)frame.ch2,
                (unsigned long)
                m_ads1292_overrun_count
            );
        }

