PengDrakes/NRF52833bcitest/examples/ble_peripheral/ble_app_uart/pca10100/s140/arm5_no_packs/ads1292.c
#endif /* ADS1292_RAWSEQ_ENABLE */

        /* ----------------------------------------------------
         * Forward EEG to Attention
         * ---------------------------------------------------- */

        attention_push_sample(
            ch2_uv
        );

        /* ----------------------------------------------------
         * Compatibility variables
         * ---------------------------------------------------- */

        vol_value =
            (int32_t)ch2_uv;

        vol_uv =
            vol_value;

        /* ====================================================
         * CH1 ring buffer
         * ==================================================== */

        if (
            (
                (write_pos_0 + 1U) %
                CYC_ARRAY_LEN
            )
            !=
            read_pos_0
        )
        {
            save_data_0[write_pos_0] =
                (int32_t)ch1_uv;

            write_pos_0 =
                (write_pos_0 + 1U) %
                CYC_ARRAY_LEN;
        }

        /* ====================================================
         * CH2 ring buffer
         * ==================================================== */

        if (
            (
                (write_pos_1 + 1U) %
                CYC_ARRAY_LEN
            )
            !=
            read_pos_1
        )
        {
            save_data_1[write_pos_1] =
                (int32_t)ch2_uv;

            write_pos_1 =
                (write_pos_1 + 1U) %
                CYC_ARRAY_LEN;
        }

        /* ====================================================
         * Common ring buffer
         * ==================================================== */

        if (
            (
                (write_pos + 1U) %
                CYC_ARRAY_LEN
            )
            !=
            read_pos
        )
        {
            save_data[write_pos] =
                (int32_t)ch2_uv;

            write_pos =
                (write_pos + 1U) %
                CYC_ARRAY_LEN;
        }

        /* ====================================================
         * Initial data collection
         * ==================================================== */

        if (!init_data_collected)
        {
            if (
                (sample_count >= INIT_SAMPLE_START) &&
                (sample_count <= INIT_SAMPLE_END)
            )
            {
                if (init_index < INIT_SAMPLE_COUNT)
                {
                    data1[init_index] =
                        ch1_uv;

                    data2[init_index] =
                        ch2_uv;

                    init_index++;
                }
            }
            else if (
                sample_count >
                INIT_SAMPLE_END
            )
            {
                init_data_collected =
                    1U;

                printf(
                    "ADS1292 init data "
                    "collection complete\r\n"
                );
            }
        }

        /* ====================================================
         * Periodic UART print
         *
         * NEW:
         * interval = 23, not 25.
         * ==================================================== */

        if (
            (
                sample_count %
                ADS1292_PRINT_INTERVAL
            )
            ==
            0U
        )
        {
#if ADS1292_INTERNAL_TEST

            printf(
                "TEST "
                "N=%lu "
                "CH2=%lduV "
                "RAW=%ld "
                "OVR=%lu\r\n",

                (unsigned long)sample_count,
                (long)ch2_uv,
                (long)frame.ch2,
                (unsigned long)
                m_ads1292_overrun_count
            );

#else

            printf(
                "EEG "
                "N=%lu "
                "CH2=%lduV "
                "RAW=%ld "
                "OVR=%lu\r\n",

                (unsigned long)sample_count,
                (long)ch2_uv,
                (long)frame.ch2,
                (unsigned long)
                m_ads1292_overrun_count
            );

#endif
        }
    }
}


/* ============================================================
 * Standalone test entry
 * ============================================================ */

int ads1292_main(void)
{
    device_init();

    if (!m_spi_initialized)
    {
        return -1;
    }

    ads1292_init();

    if (!m_ads1292_ready)
    {
        return -2;
    }

    return 0;
}